app/views/comments/_comment.html.haml

INSERT INTO "comments" ("content", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "TEST"], ["message_id", 1], ["created_at", "2016-04-16 12:44:19.392257"], ["updated_at", "2016-04-16 12:44:19.392257"]]
---
  %p.comment-posted-by
    Posted by #{comment.user.email} #{time_ago_in_words(comment.created_at)} ago
  .links