app/views/users/edit.html.haml

SELECT "roles".* FROM "roles"
---
        = f.input :zip, required: true, autofocus: true
        = f.association :roles, as: :check_boxes, collection: Role.all
      .form-actions