app/views/users/show.html.haml

SELECT  "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  ORDER BY "roles"."id" DESC LIMIT 1  [["user_id", 27]]
---
      %th Role
      %td #{@user.roles.last.name.capitalize}