app/controllers/comments_controller.rb

  def create
    @comment = @message.comments.create(comment_params)
    @comment.user_id = current_user.id

    if @comment.save
---
INSERT INTO "comments" ("content", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "TEST"], ["message_id", 1], ["created_at", "2016-04-16 12:44:19.392257"], ["updated_at", "2016-04-16 12:44:19.392257"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 12], ["updated_at", "2016-04-16 12:44:19.396669"], ["id", 1]]

  def update
    if @comment.update(comment_params)
---
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "test123111"], ["updated_at", "2016-04-16 14:36:14.709204"], ["id", 3]]

  def find_message
    @message = Message.find(params[:message_id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 5]]

  def find_comment
    @comment = @message.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."message_id" = ? AND "comments"."id" = ? LIMIT 1  [["message_id", 5], ["id", 3]]