app/controllers/messages_controller.rb

  def index
    @messages = Message.all.order("created_at DESC")
---
SELECT "messages".* FROM "messages"  ORDER BY created_at DESC

  def create
    @message = current_user.messages.build(message_params)
    if @message.save
---
INSERT INTO "messages" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "TEST"], ["description", "TEST"], ["user_id", 12], ["created_at", "2016-04-16 12:44:14.589611"], ["updated_at", "2016-04-16 12:44:14.589611"]]

  def update
    if @message.update(message_params)
---
UPDATE "messages" SET "title" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["title", "test123"], ["updated_at", "2016-04-16 14:34:33.596814"], ["id", 4]]

  def find_message
    @message = Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE (title LIKE '%tet%' or description LIKE '%tet%')