app/controllers/users_controller.rb

  def update
    unless params[:user][:birthday].blank?
      params[:user][:birthday] = DateTime.strptime(params[:user][:birthday], "%d/%m/%Y")
    end
    if @user.update(user_params)
---
UPDATE "users" SET "address" = ?, "city" = ?, "state" = ?, "country" = ?, "zip" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["address", ""], ["city", "123"], ["state", ""], ["country", ""], ["zip", ""], ["latitude", 20.6582941], ["longitude", -75.3446802], ["updated_at", "2016-04-16 13:41:56.610116"], ["id", 11]]

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 10]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 13]]